---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingFailed
source: html/9da5d940-9d4d-4421-befa-d73ed6cb4edf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingFailed Property

Sizing failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId SizingFailed { get; }
```